Spring/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getDataRequest>
         <gs:titel>x</gs:titel>
      </gs:getDataRequest>
   </soapenv:Body>
</soapenv:Envelope>
